#include<stdio.h>
#include<stdlib.h>
int main()
{
	unsigned int a = 1;//正数的原码，反码补码都是一样
	unsigned int b = -2;
	//所有数据在计算机中都是以补码的方式存在
	//a的原码==0000 0000 0000 0000 0000 0000 0000 0001
	//负数的反码==源码所有位1变0，0变1;
	//补码==反码+1;
	printf("%d\n",a+b);	
	//0 000 0000 0000 0000 0000 0000 0000 0001（1的补码）最高位表示正负
	//1 111 1111 1111 1111 1111 1111 1111 1100 （-2的补码）
	//1 111 1111 1111 1111 1111 1111 1111 1111  （-1的补码）
	

    //1 000 0000 0000 0000 0000 0000 0000 0001（-1的原码）
	//1 111 1111 1111 1111 1111 1111 1111 1110（-1的反码）
	//1 111 1111 1111 1111 1111 1111 1111 1111（-1的补码）
	getchar();
	return 0;
}